; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v1 - type_1 ?v3 - type_2)
 	      (pred_4 ?v5 - object ?v3 - type_2)
	      (pred_1 ?v1 - type_1 ?v8 - type_3)
	      (pred_2 ?v1 - type_1 ?v5 - object ?v8 - type_3))

   (:action op_1
       :parameters  (?v1 - type_1 ?v4 ?v6 - type_2)
       :precondition (and  (pred_3 ?v1 ?v4))
       :effect (and  (pred_3 ?v1 ?v6)
		     (not (pred_3 ?v1 ?v4))))

   (:action op_2
       :parameters (?v1 - type_1 ?v2 - object ?v7 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_4 ?v2 ?v7) (pred_3 ?v1 ?v7) (pred_1 ?v1 ?v8))
       :effect (and (pred_2 ?v1 ?v2 ?v8)
		    (not (pred_4 ?v2 ?v7)) 
		    (not (pred_1 ?v1 ?v8))))

   (:action op_3
       :parameters (?v1 - type_1 ?v2 - object ?v7 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_2 ?v1 ?v2 ?v8) (pred_3 ?v1 ?v7))
       :effect (and (pred_4 ?v2 ?v7)
		    (pred_1 ?v1 ?v8)
		    (not (pred_2 ?v1 ?v2 ?v8)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_11 obj_02 - type_1
obj_04 obj_10 obj_05 obj_08 - type_3
obj_01 obj_03 obj_12 - type_2
obj_06 obj_09 obj_07 - object)
(:init
(pred_3 obj_11 obj_03)
(pred_1 obj_11 obj_04)
(pred_1 obj_11 obj_10)
(pred_3 obj_02 obj_12)
(pred_1 obj_02 obj_05)
(pred_1 obj_02 obj_08)
(pred_4 obj_06 obj_12)
(pred_4 obj_09 obj_12)
(pred_4 obj_07 obj_12)
)
(:goal
(and
(pred_4 obj_06 obj_03)
(pred_4 obj_09 obj_01)
(pred_4 obj_07 obj_03)
)
)

(:constraints
  (always (not (pred_3 obj_11 obj_12)))
)
)

; plan
1. (op_2 obj_02 obj_09 obj_12 obj_08)
   deleted: (pred_4 obj_09 obj_12) (pred_1 obj_02 obj_08)
   added: (pred_2 obj_02 obj_09 obj_08)
   goals met: 0 of 3
2. (op_1 obj_02 obj_12 obj_01)
   deleted: (pred_3 obj_02 obj_12)
   added: (pred_3 obj_02 obj_01)
   goals met: 0 of 3
3. (op_3 obj_02 obj_09 obj_01 obj_08)
   deleted: (pred_2 obj_02 obj_09 obj_08)
   added: (pred_4 obj_09 obj_01) (pred_1 obj_02 obj_08)
   goals met: 1 of 3
4. (op_1 obj_02 obj_01 obj_12)
   deleted: (pred_3 obj_02 obj_01)
   added: (pred_3 obj_02 obj_12)
   goals met: 1 of 3
5. (op_2 obj_02 obj_06 obj_12 obj_08)
   deleted: (pred_4 obj_06 obj_12) (pred_1 obj_02 obj_08)
   added: (pred_2 obj_02 obj_06 obj_08)
   goals met: 1 of 3
6. (op_2 obj_02 obj_07 obj_12 obj_05)
   deleted: (pred_4 obj_07 obj_12) (pred_1 obj_02 obj_05)
   added: (pred_2 obj_02 obj_07 obj_05)
   goals met: 1 of 3
7. (op_1 obj_02 obj_12 obj_03)
   deleted: (pred_3 obj_02 obj_12)
   added: (pred_3 obj_02 obj_03)
   goals met: 1 of 3
8. (op_3 obj_02 obj_07 obj_03 obj_05)
   deleted: (pred_2 obj_02 obj_07 obj_05)
   added: (pred_4 obj_07 obj_03) (pred_1 obj_02 obj_05)
   goals met: 2 of 3
9. (op_3 obj_02 obj_06 obj_03 obj_08)
   deleted: (pred_2 obj_02 obj_06 obj_08)
   added: (pred_4 obj_06 obj_03) (pred_1 obj_02 obj_08)
   goals met: 3 of 3
